index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-12 Wed 16:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Attachment Converter</title>
<meta name="author" content="Matt Teichman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Attachment Converter</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org37777bb">1. Introduction</a></li>
<li><a href="#org530a729">2. GitHub</a></li>
<li><a href="#org448aaf8">3. Development Team</a></li>
<li><a href="#orgc4268bd">4. Installation </a>
<ul>
<li><a href="#org54df93c">4.1. Build</a>
<ul>
<li><a href="#orge58a950">4.1.1. Download the source</a></li>
<li><a href="#orgeab04a6">4.1.2. Install <code>opam</code></a></li>
<li><a href="#orgb4a1e0e">4.1.3. Install <code>opam</code> dependencies</a></li>
<li><a href="#orgdb28c95">4.1.4. Install OS-level dependencies</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org37777bb" class="outline-2">
<h2 id="org37777bb"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Attachment Converter is an open-source command-line tool for digital
archivists.  Given an email mailbox in <a href="https://en.wikipedia.org/wiki/Mbox">MBOX</a> format, it will go through
that mailbox and batch convert all the attachments it can into
preservation formats, putting each one back into the email from which
it originated.  The user can then re-open the new mailbox in a mail
user agent, such as <a href="https://en.wikipedia.org/wiki/Apple_Mail">Apple Mail</a>, and browse through the mailbox the
normal way.
</p>
</div>
</div>

<div id="outline-container-org530a729" class="outline-2">
<h2 id="org530a729"><span class="section-number-2">2.</span> GitHub</h2>
<div class="outline-text-2" id="text-2">
<p>
Our GitHub page can be found here:
</p>

<p>
<a href="https://github.com/uchicago-library/attachment-converter">https://github.com/uchicago-library/attachment-converter</a>
</p>

<p>
We are currently in the pre-alpha phase, gearing up to our first round
of user testing.  One the project is released, we will provide
multiple out-of-the-box installation options.  However, as of April
2023, the only way to install Attachment Converter is to build it from
source.  <a href="#orgadd3133">See below</a> for installation instructions.
</p>
</div>
</div>

<div id="outline-container-org448aaf8" class="outline-2">
<h2 id="org448aaf8"><span class="section-number-2">3.</span> Development Team</h2>
<div class="outline-text-2" id="text-3">
<p>
This project originates from the <a href="https://www.lib.uchicago.edu">UChicago Library</a> <a href="https://dldc.lib.uchicago.edu">Digital Library
Development Center</a>.  The current development team is:
</p>

<ul class="org-ul">
<li><a href="https://nmmull.github.io/">Nathan Mull</a></li>
<li><a href="https://elucidations.vercel.app/">Matt Teichman</a></li>
</ul>

<p>
Matt has been project manager for the initial development phase and is
getting ready to transition into the lead developer role.  Previous
(and possibly future?) members of our illustrious dev team include:
</p>

<ul class="org-ul">
<li><a href="https://github.com/OwenPriceSkelly">Owen Price Skelly</a></li>
<li><a href="https://github.com/cormacd9818">Cormac Duhamel</a></li>
</ul>

<p>
We are also grateful to <a href="https://www2.lib.uchicago.edu/keith/">Keith Waclena</a> for allowing us to tap into his
endless wisdom regarding the email specification, UNIX systems
programming, and the OCaml language throughout our work on this
project.
</p>
</div>
</div>

<div id="outline-container-orgc4268bd" class="outline-2">
<h2 id="orgc4268bd"><span class="section-number-2">4.</span> Installation <a id="orgadd3133"></a></h2>
<div class="outline-text-2" id="text-4">
<p>
Once this software is ready for official release, we will be providing
multiple installation options across as many hardware and OS platforms
as we can.  Currently, however, the only way to install the project is
to build it from source, which is only a realistic option for either
software developers or system administrators.  For ordinary users, we
would like to make Attachment Converter available to install via one
standard package managers and also directly as a binary upon its first
release.  Please check back in the summer for updates!
</p>

<p>
As we work toward our first release, here are instructions for
building Attachment Converter from source and then installing it.
</p>
</div>

<div id="outline-container-org54df93c" class="outline-3">
<h3 id="org54df93c"><span class="section-number-3">4.1.</span> Build</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orge58a950" class="outline-4">
<h4 id="orge58a950"><span class="section-number-4">4.1.1.</span> Download the source</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
You can get the latest source straight from our <a href="https://github.com/uchicago-library/attachment-converter">GitHub repository</a>:
</p>

<pre class="example" id="orgb252582">
$ cd /path/to/your/source/code
$ git clone https://github.com/uchicago-library/attachment-converter.git
</pre>
</div>
</div>

<div id="outline-container-orgeab04a6" class="outline-4">
<h4 id="orgeab04a6"><span class="section-number-4">4.1.2.</span> Install <code>opam</code></h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Attachment Converter is written in <a href="https://ocaml.org/">OCaml</a>, which means that in order to
build it, you need to install the <code>opam</code> package manager, which we
recommend doing via your operating system's package manager.  For
example:
</p>

<p>
Arch Linux:
</p>

<pre class="example" id="orgfdaf618">
$ pacman -S opam
</pre>

<p>
macOS:
</p>

<pre class="example" id="org54aee05">
$ brew install opam
</pre>

<p>
WSL Ubuntu:
</p>

<pre class="example" id="orga3c6291">
$ apt install opam
</pre>

<p>
Then, regardless of how you install <code>opam</code>, you need to initialize it
in order to be able to use it.
</p>

<pre class="example" id="org42a8611">
$ cd ~
$ opam init
$ eval $(opam env)
</pre>

<p>
<code>opam</code> should then print some information to the console telling you
about the steps it's taking to initialize.
</p>
</div>
</div>

<div id="outline-container-orgb4a1e0e" class="outline-4">
<h4 id="orgb4a1e0e"><span class="section-number-4">4.1.3.</span> Install <code>opam</code> dependencies</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
To install all third-party library dependencies for Attachment
Converter to your <code>~/.opam</code> directory (which is where <code>opam</code> put the
OCaml compiler and other packages it's going to use when you ran <code>opam
init</code>), please run the following <code>make</code> rule from the root directory
of the GitHub project you cloned:
</p>

<pre class="example" id="org02734e3">
$ cd /path/to/your/source/code/attachment-converter
$ make deps
</pre>

<p>
This will make <a href="https://dldc.lib.uchicago.edu/opam">the DLDC's very own <code>opam</code> repository</a> available to you,
then install all of Attachment Converter's third-party library
dependencies.
</p>
</div>
</div>

<div id="outline-container-orgdb28c95" class="outline-4">
<h4 id="orgdb28c95"><span class="section-number-4">4.1.4.</span> Install OS-level dependencies</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
First, install Attachment Converter's OS-level dependencies.  For
example:
</p>

<p>
Arch Linux:
</p>
<pre class="example" id="org34d66a3">
$ pacman -S libreoffice pdftotext pandoc vips
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Teichman</p>
<p class="date">Created: 2023-04-12 Wed 16:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
